/*****************************************************************************************
*	电机就位外部中断捕获
*	采用TIM1,通过PA9_CH1输出PWM1信号
*	PD2使能开关,0 停  1 启动
*
*	步进电机说明：
*	1、设备
*		驱动器M542，步进电机57HBP76AL4
*		M542: http://www.xlichuan.com/content/?185.html
*	2、驱动器接线
*		PUL+、DIR+、ENA+接MCU板的VCC
*		PUL-接motor_pul(PWM信号)、DIR-接MCU的GND
*		ENA-接正启动电机，接负停止电机(可以悬空)
*	3、电机接线
*		红线接A+，绿线接A-
*		黄线接B+，蓝线接B-
*
*
*
*
*****************************************************************************************/
#ifndef __EXTI_H__
#define __EXTI_H__

#include "basedef.h"


#ifdef __cplusplus
extern "C" {
#endif

extern volatile uint8_t g_motorReady;		// 电机是否就位，产生中断就认为就绪

	
/*****************************************************************************************
	<< --- exti_config	2015-10-31 --- >>
	说明：外部中断配置
	参数：
	返回值：
*****************************************************************************************/
extern void exti_config(void);

/*****************************************************************************************
	<< --- exti_start 	exti_stop	2015-10-31 --- >>
	说明：外中断启动和停止
	参数：
	返回值：
*****************************************************************************************/
extern void exti_start(void);
extern void exti_stop(void);



#ifdef __cplusplus
}
#endif


#endif // __EXTI_H__
// 
