/*****************************************************************************************
*	数据存储
*	用户数据写在最后一页
*
*
*
*
*****************************************************************************************/
#ifndef __FLASH_H__
#define __FLASH_H__

#include "basedef.h"

#ifdef __cplusplus
extern "C" {
#endif
	

/*****************************************************************************************
	<< --- flash_write		2015-11-12 --- >>
	说明：写数据
	参数：
		address		= 起始地址，相对起始某页起始地址
		pData		= 被写的数据
		dataLength	= 数据长度
	返回值：
*****************************************************************************************/
extern void flash_write(uint32_t address, const uint8_t *pData, uint16_t dataLength);
	
/*****************************************************************************************
	<< --- flash_read		2015-11-12 --- >>
	说明：读取数据
	参数：
		address		= 起始地址，相对起始某页起始地址
		pDataBuf	= 数据保存缓存区
		dataLength	= 要读取数据的长度
	返回值：
*****************************************************************************************/
extern void flash_read(uint32_t address, uint8_t *pDataBuf, uint16_t dataLength);

#ifdef __cplusplus
}
#endif


#endif	// __FLASH_H__
// 

