/*****************************************************************************************
*	步进电机控制
*	采用TIM1,通过PA9_CH1输出PWM1信号
*	PD2使能开关,0 停  1 启动
*
*	步进电机说明：
*	1、设备
*		驱动器M542，步进电机57HBP76AL4
*		M542: http://www.xlichuan.com/content/?185.html
*	2、驱动器接线
*		PUL+、DIR+、ENA+接MCU板的VCC
*		PUL-接motor_pul(PWM信号)、DIR-接MCU的GND
*		ENA-接正启动电机，接负停止电机(可以悬空)
*	3、电机接线
*		红线接A+，绿线接A-
*		黄线接B+，蓝线接B-
*
*
*
*
*****************************************************************************************/

#ifndef __MOTOR_H__
#define __MOTOR_H__

#include "basedef.h"

#ifdef __cplusplus
extern "C" {
#endif
	
// 电机转圈辅助计数器
extern volatile uint32_t	g_loopMoto;		// 电机计数
	
/*****************************************************************************************
	<< --- motor_config		2015-10-31 --- >>
	说明：配置TIM1的PA6口PWM输出
	参数：
		tim4Period		= 自动重装值
		tim4Prescaler	= 时钟预分频数
	返回值：
*****************************************************************************************/
extern void motor_config(void);
	
/*****************************************************************************************
	<< --- motor_start 	motor_stop	2015-10-31 --- >>
	说明：步进电机启动和停止
	参数：
	返回值：
*****************************************************************************************/
extern void motor_start(void);
extern void motor_stop(void);
	
#ifdef __cplusplus
}
#endif

#endif // __MOTOR_H__

// 
