#ifndef __SCRECTIFIER_H__
#define __SCRECTIFIER_H__
#include "basedef.h"

#ifdef __cplusplus
extern "C" {
#endif

	
/*****************************************************************************************
	<< --- scr_adjustPower		2015-10-26 --- >>
	说明：调整调功板的输出功率
	参数：
		address		= 设备485地址
		outway		= 通道号，基于1[1--4](通道1)
		toPower		= 输出功率，取值范围[0x00-0xFF], 0x00功率最大, 0xFF最小
	返回值：
*****************************************************************************************/
extern void scr_adjustPower(uint8_t address, uint8_t outway, uint8_t toPower);

/*****************************************************************************************
	<< --- scr_stopPower		2015-10-26 --- >>
	说明：停止调功板指定通道的输出功率
	参数：
		address		= 设备485地址
		outway		= 通道号，基于1[1--4](通道1)
	返回值：
*****************************************************************************************/
extern void scr_stopPower(uint8_t address, uint8_t outway);
	
/*****************************************************************************************
	<< --- scr_stopPowerAll		2015-10-26 --- >>
	说明：停止调功板各路通道的输出功率
	参数：
		address		= 设备485地址
	返回值：
*****************************************************************************************/
extern void scr_stopPowerAll(uint8_t address);

#ifdef __cplusplus
}
#endif

#endif

//
